tomaskovacik/MegaCore/avr/boards.txt
# Clock frequencies
2560.menu.clock.16MHz_external=External 16 MHz
2560.menu.clock.16MHz_external.upload.speed=115200
2560.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.16MHz_external.build.clkpr=
2560.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.16MHz_external.build.f_cpu=16000000L

2560.menu.clock.20MHz_external=External 20 MHz
2560.menu.clock.20MHz_external.upload.speed=115200
2560.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.20MHz_external.build.clkpr=
2560.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.20MHz_external.build.f_cpu=20000000L

2560.menu.clock.18_432MHz_external=External 18.4320 MHz
2560.menu.clock.18_432MHz_external.upload.speed=115200
2560.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.18_432MHz_external.build.clkpr=
2560.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.18_432MHz_external.build.f_cpu=18432000L

2560.menu.clock.14_7456MHz_external=External 14.7456 MHz
2560.menu.clock.14_7456MHz_external.upload.speed=115200
2560.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.14_7456MHz_external.build.clkpr=
2560.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

2560.menu.clock.12MHz_external=External 12 MHz
2560.menu.clock.12MHz_external.upload.speed=57600
2560.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.12MHz_external.build.clkpr=
2560.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.12MHz_external.build.f_cpu=12000000L

2560.menu.clock.11_0592MHz_external=External 11.0592 MHz
2560.menu.clock.11_0592MHz_external.upload.speed=115200
2560.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.11_0592MHz_external.build.clkpr=
2560.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

2560.menu.clock.8MHz_external=External 8 MHz
2560.menu.clock.8MHz_external.upload.speed=57600
2560.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.8MHz_external.build.clkpr=
2560.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.8MHz_external.build.f_cpu=8000000L

2560.menu.clock.7_3728MHz_external=External 7.3728 MHz
2560.menu.clock.7_3728MHz_external.upload.speed=115200
2560.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.7_3728MHz_external.build.clkpr=
2560.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

2560.menu.clock.4MHz_external=External 4 MHz
2560.menu.clock.4MHz_external.upload.speed=9600
2560.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.4MHz_external.build.clkpr=
2560.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.4MHz_external.build.f_cpu=4000000L

2560.menu.clock.3_6864MHz_external=External 3.6864 MHz
2560.menu.clock.3_6864MHz_external.upload.speed=115200
2560.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.3_6864MHz_external.build.clkpr=
2560.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

2560.menu.clock.2MHz_external=External 2 MHz
2560.menu.clock.2MHz_external.upload.speed=9600
2560.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.2MHz_external.build.clkpr=
2560.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.2MHz_external.build.f_cpu=2000000L

2560.menu.clock.1_8432MHz_external=External 1.8432 MHz
2560.menu.clock.1_8432MHz_external.upload.speed=115200
2560.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.1_8432MHz_external.build.clkpr=
2560.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

2560.menu.clock.1MHz_external=External 1 MHz
2560.menu.clock.1MHz_external.upload.speed=9600
2560.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.1MHz_external.build.clkpr=
2560.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
2560.menu.clock.1MHz_external.build.f_cpu=1000000L

2560.menu.clock.8MHz_internal=Internal 8 MHz
2560.menu.clock.8MHz_internal.upload.speed=38400
2560.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.8MHz_internal.build.clkpr=
2560.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
2560.menu.clock.8MHz_internal.build.f_cpu=8000000L

2560.menu.clock.4MHz_internal=Internal 4 MHz
2560.menu.clock.4MHz_internal.upload.speed=9600
2560.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
2560.menu.clock.4MHz_internal.build.clock_speed=8000000L
2560.menu.clock.4MHz_internal.build.f_cpu=4000000L

2560.menu.clock.2MHz_internal=Internal 2 MHz
2560.menu.clock.2MHz_internal.upload.speed=9600
2560.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
2560.menu.clock.2MHz_internal.build.clock_speed=8000000L
2560.menu.clock.2MHz_internal.build.f_cpu=2000000L

2560.menu.clock.1MHz_internal=Internal 1 MHz
2560.menu.clock.1MHz_internal.upload.speed=9600
2560.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2560.menu.clock.1MHz_internal.build.clkpr=
2560.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
2560.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega1281  ####
#####################

# General
1281.name=ATmega1281
1281.upload.tool=avrdude
1281.upload.maximum_data_size=8192
1281.bootloader.tool=avrdude
1281.bootloader.unlock_bits=0x3f
1281.bootloader.lock_bits=0x0f
1281.build.core=MCUdude_corefiles
1281.build.variant=64-pin-avr
1281.build.board=AVR_ATmega1281
1281.build.mcu=atmega1281
1281.build.bootloader_led=B5
1281.build.extra_flags={build.clkpr}

# Upload port select
1281.menu.bootloader.uart0=Yes (UART0)
1281.menu.bootloader.uart0.upload.maximum_size=130048
1281.menu.bootloader.uart0.upload.protocol=arduino
1281.menu.bootloader.uart0.upload.port=UART0
1281.menu.bootloader.uart0.build.export_merged_output=true
1281.menu.bootloader.uart0.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
1281.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

1281.menu.bootloader.uart1=Yes (UART1)
1281.menu.bootloader.uart1.upload.maximum_size=130048
1281.menu.bootloader.uart1.upload.protocol=arduino
1281.menu.bootloader.uart1.upload.port=UART1
1281.menu.bootloader.uart1.build.export_merged_output=true
1281.menu.bootloader.uart1.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
1281.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

1281.menu.bootloader.no_bootloader=No bootloader
1281.menu.bootloader.no_bootloader.upload.maximum_size=131072
1281.menu.bootloader.no_bootloader.build.export_merged_output=false
1281.menu.bootloader.no_bootloader.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
1281.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
1281.menu.eeprom.keep=EEPROM retained
1281.menu.eeprom.keep.bootloader.eesave_bit=0
1281.menu.eeprom.erase=EEPROM not retained
1281.menu.eeprom.erase.bootloader.eesave_bit=1

# Brown out detection
1281.menu.BOD.2v7=BOD 2.7V
1281.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1281.menu.BOD.4v3=BOD 4.3V
1281.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1281.menu.BOD.1v8=BOD 1.8V
1281.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1281.menu.BOD.disabled=BOD disabled
1281.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1281.menu.LTO.Os=LTO disabled
1281.menu.LTO.Os.compiler.c.extra_flags=
1281.menu.LTO.Os.compiler.c.elf.extra_flags=
1281.menu.LTO.Os.compiler.cpp.extra_flags=
1281.menu.LTO.Os.ltoarcmd=avr-ar

